# Rebar Get Hook Rotation Angle Method

Source: https://www.revitapidocs.com/2026/0217f682-0c09-2b77-02d4-89c494a11cc9.htm

---

| Rebar Get Hook Rotation Angle Method |
| --- |

**Note: This API is now obsolete.**

Gets the termination's out of plane rotation angle at the specified end. The rotation angle it's the same for both hook and crank.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.GetTerminationRotationAngle instead.")]
public double GetHookRotationAngle(
	int end
)
```

```
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.GetTerminationRotationAngle instead.")>
Public Function GetHookRotationAngle (
	end As Integer
) As Double
```

```
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.GetTerminationRotationAngle instead.")]
double GetHookRotationAngle(
	int end
)
```

```
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.GetTerminationRotationAngle instead.")>]
member GetHookRotationAngle :
        end : int -> float
```

#### Parameters

end Int32
:   0 for the start, 1 for the end.

#### Return Value

Double
Returns the termination's out of plane rotation angle at the specified end. The rotation angle it's the same for both hook and crank. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | end must be 0 or 1\. |

See Also

#### Reference

Rebar Class Autodesk.Revit.DB.Structure Namespace